In [7]:
# import necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

import xgboost as xgb
import lightgbm as lgb
from sklearn.svm import SVC
from sklearn.ensemble import BaggingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier, ExtraTreesClassifier
from sklearn.model_selection import RandomizedSearchCV,GridSearchCV
from sklearn.model_selection import KFold
from datetime import datetime
import warnings

In [13]:
# Load the dataset
credit_df=pd.read_csv("Credit Data.csv")
credit_df.head()

,age,gender,education,occupation,organization_type,seniority,annual_income,disposable_income,house_type,vehicle_type,marital_status,no_card,default
0,19,Male,Graduate,Professional,NaN,NaN,186319,21625,Family,NaN,Married,0,1
1,18,Male,Under Graduate,Professional,NaN,NaN,277022,20442,Rented,NaN,Married,0,1
2,29,Male,Under Graduate,Salaried,NaN,Entry,348676,24404,Rented,NaN,Married,1,1
3,18,Male,Graduate,Student,NaN,NaN,165041,2533,Rented,NaN,Married,0,1
4,26,Male,Post Graduate,Salaried,NaN,Mid-level 1,348745,19321,Rented,NaN,Married,1,1

In [10]:
credit_df.shape

(50636, 13)

In [ ]:
# check for null values
credit_df.isnull().sum()

age                      0
gender                   0
education                0
occupation               0
organization_type    35884
seniority            20898
annual_income            0
disposable_income        0
house_type               0
vehicle_type         33301
marital_status           0
no_card                  0
default                  0
dtype: int64

In [23]:
# see the statistical analysis of the dataset
credit_df.describe()

,age,annual_income,disposable_income,no_card,default
count,50636.000000,50636.000000,50636.000000,50636.000000,50636.000000
mean,29.527411,277243.989889,18325.788569,0.509815,0.158425
std,8.816532,153838.973755,12677.864844,0.669883,0.365142
min,18.000000,50000.000000,1000.000000,0.000000,0.000000
25%,25.000000,154052.250000,8317.750000,0.000000,0.000000
50%,27.000000,258860.500000,15770.000000,0.000000,0.000000
75%,30.000000,385071.500000,24135.000000,1.000000,0.000000
max,64.000000,999844.000000,49999.000000,2.000000,1.000000

In [24]:
# Separate columns having categorical value
obj_df = credit_df.select_dtypes(include=['object']).copy()
obj_df.head()

,gender,education,occupation,organization_type,seniority,house_type,vehicle_type,marital_status
0,Male,Graduate,Professional,NaN,NaN,Family,NaN,Married
1,Male,Under Graduate,Professional,NaN,NaN,Rented,NaN,Married
2,Male,Under Graduate,Salaried,NaN,Entry,Rented,NaN,Married
3,Male,Graduate,Student,NaN,NaN,Rented,NaN,Married
4,Male,Post Graduate,Salaried,NaN,Mid-level 1,Rented,NaN,Married

In [25]:
# find unique values present in "no_card" column
credit_df['no_card'].value_counts()

no_card
0    29855
1    15747
2     5034
Name: count, dtype: int64

In [26]:
# add column "no_card" to the dataframe "obj_df"
obj_df['no_card']=credit_df['no_card']